---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Mesh
source: html/73c32522-8475-2aeb-4e2a-401b1f699425.htm
---
# Mesh Members

Computes and returns the surface area of the mesh. The surface area is the sum of the areas of the
 constituent facets of the mesh.